# Вариант 1
# -------------------------------------------------------
my_func = lambda x, y: x ** y
print(my_func(2, -5))

# Вариант 2
# -------------------------------------------------------
def my_func2(x, y):
    """
    Программа принимает действительное положительное число x и целое отрицательное число y.
    """
    result = x
    if x != 0:
        for i in range(abs(y)-1):
            result = result * x
        result = 1 / result
        print(result)
    else:
        print('x не может равняться 0')


my_func2(2, -5)