# Смотрим что в файле
# -------------------------------------------------------
with open('file_to_3_dz.txt', 'r') as f:
    content = f.read()
    print(f'Общий список:\n{content}')

# Кто мало зарабатывает?
# -------------------------------------------------------
with open('file_to_3_dz.txt', 'r') as f:
    zp = 0
    count = 0
    for line in f:
        if float(line.split(' ')[1]) < 20000:
            print(f'Зарплата меньше 20 тыс.: ', line.split(' ')[0])

        # Кто мало зарабатывает?
        # -------------------------------------------------------
        zp = zp + float(line.split(' ')[1])
        count += 1
    print('\nСредняя величина дохода сотрудников: ', zp / count)